"""""
# Пользователь вводит с клавиатуры три числа в переменные a, b, c.
# Найдите наибольшее число из них и запишите в переменную max.
"""""
a = int(input('Please enter A number:'))
b = int(input('Please enter B number:'))
c = int(input('Please enter C number:'))
print(f'max =  {max(a, b, c)}')
